; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-5-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-3 - location
	p0-5 - location
	p1-2 - location
	p2-3 - location
	p2-5 - location
	p3-1 - location
	p4-0 - location
	p4-3 - location
	p5-3 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s3)
	(at driver4 s1)
	(at driver5 s2)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at package1 s2)
	(at package2 s3)
	(at package3 s2)
	(at package4 s3)
	(at package5 s0)
	(at package6 s0)
	(at package7 s1)
	(at package8 s4)
	(at package9 s3)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(link s0 s1)
	(link s1 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s4)
	(link s4 s1)
	(link s2 s3)
	(link s3 s2)
	(link s2 s5)
	(link s5 s2)
	(link s4 s0)
	(link s0 s4)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver2 s2)
	(at driver4 s3)
	(at truck2 s3)
	(at truck3 s2)
	(at truck5 s2)
	(at package1 s4)
	(at package2 s3)
	(at package3 s0)
	(at package4 s2)
	(at package5 s4)
	(at package6 s5)
	(at package7 s3)
	(at package8 s2)
	(at package9 s4)
	))


)

; plan
1. (board-truck driver4 s1 truck1)
   deleted: (at driver4 s1) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 3 of 14
2. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 3 of 14
3. (load-truck s0 package6 truck1)
   deleted: (at package6 s0)
   added: (in package6 truck1)
   goals met: 3 of 14
4. (load-truck s0 package5 truck1)
   deleted: (at package5 s0)
   added: (in package5 truck1)
   goals met: 3 of 14
5. (drive-truck driver4 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 3 of 14
6. (load-truck s3 package9 truck1)
   deleted: (at package9 s3)
   added: (in package9 truck1)
   goals met: 3 of 14
7. (drive-truck driver4 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 3 of 14
8. (unload-truck s4 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s4)
   goals met: 4 of 14
9. (load-truck s4 package8 truck1)
   deleted: (at package8 s4)
   added: (in package8 truck1)
   goals met: 4 of 14
10. (drive-truck driver4 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 4 of 14
11. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 4 of 14
12. (unload-truck s2 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s2)
   goals met: 5 of 14
13. (load-truck s2 package3 truck1)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   goals met: 5 of 14
14. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 5 of 14
15. (drive-truck driver4 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 5 of 14
16. (unload-truck s0 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   goals met: 6 of 14
17. (board-truck driver2 s5 truck3)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 6 of 14
18. (load-truck s3 package4 truck2)
   deleted: (at package4 s3)
   added: (in package4 truck2)
   goals met: 6 of 14
19. (board-truck driver3 s3 truck2)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 6 of 14
20. (drive-truck driver3 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 5 of 14
21. (unload-truck s2 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s2)
   goals met: 6 of 14
22. (load-truck s2 package1 truck2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 6 of 14
23. (drive-truck driver3 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 7 of 14
24. (drive-truck driver2 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 8 of 14
25. (disembark-truck driver2 s2 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 9 of 14
26. (drive-truck driver4 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 9 of 14
27. (unload-truck s4 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s4)
   goals met: 10 of 14
28. (drive-truck driver4 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 10 of 14
29. (drive-truck driver3 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 9 of 14
30. (unload-truck s4 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s4)
   goals met: 10 of 14
31. (drive-truck driver4 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 10 of 14
32. (unload-truck s5 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   goals met: 11 of 14
33. (drive-truck driver4 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 11 of 14
34. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 11 of 14
35. (disembark-truck driver4 s3 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s3) (empty truck1)
   goals met: 12 of 14
36. (drive-truck driver3 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 12 of 14
37. (load-truck s1 package7 truck2)
   deleted: (at package7 s1)
   added: (in package7 truck2)
   goals met: 12 of 14
38. (drive-truck driver3 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 12 of 14
39. (drive-truck driver3 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 13 of 14
40. (unload-truck s3 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s3)
   goals met: 14 of 14
